class Audios {
  const Audios();
  static const Map<String, String> _hem = {
    "90s 963HZ": "全息963HZ",
    "90s 852HZ": "睡眠852HZ",
    "90s 714HZ": "代谢714HZ",
    "90s 639HZ": "免疫639HZ",
    "90s 528HZ": "消化528HZ",
    "90s 417HZ": "幸福417HZ",
    "90s 396HZ": "动力396HZ"
  };
  get hem => _hem;

  static const Map<String, String> _bgm = {
    "BGM Hang": "手碟",
    "BGM Piano": "钢琴",
    "BGM Guitar": "吉他",
    "BGM Flute": "长笛",
    "BGM Violin": "小提琴",
    "BGM Cello": "大提琴",
    "BGM Guzheng": "古筝"
  };
  get bgm => _bgm;

  static const Map<String, String> _env = {
    "40s Birds Songs": "鸟鸣",
    "40s Fire": "篝火",
    "40s Night": "虫鸣",
    "40s Rain Drop Lotus": "细雨",
    "40s Rivulet": "小溪流",
    "40s Singing Bowl": "颂钵",
    "40s Water Drops": "水滴"
  };
  get env => _env;

  static const Map<String, String> _bbm = {
    "60s 1HZ": "德尔塔波1HZ助眠",
    "60s 10HZ": "阿尔法波10HZ放松",
    "60s 40HZ": "伽马波40HZ专注"
  };
  get bbm => _bbm;

  static const Map<String, String> _too = {
    "10s Singging Bowl": "颂钵",
    "10s Rain Stick": "雨棍",
    "10s Bell": "丁夏",
    "10s Wind Chime1": "风铃春",
    "10s Wind Chime2": "风铃夏",
    "10s Wind Chime3": "风铃秋",
    "10s Wind Chime4": "风铃冬",
    "10s Shaman Drum": "萨满鼓",
    "10s Sea Wave Drum": "海浪鼓"
  };
  get too => _too;

  static const Map<String, String> _txt = {
    "全息能量｜愉悦感":
        "当963Hz的宇宙频率漫过耳际，松果体开始与星辰同频震颤。在悠远的鸟鸣协奏中，于您的神经脉络间编织出光的网格。雨林深处的画眉啼啭与量子共振波完美相融，形成全息能量场域——每声羽翼振颤都是激活DNA记忆的密钥，每段音程跃迁都在重构生物电场。",
    "睡眠能量｜松弛感":
        "当852Hz的梵音频率渗入耳膜，褪黑素开始与月相共振翻涌。千年古木燃烧的噼啪声波携带着热能记忆，与疗愈频率交织成三维热能共振场——每簇火焰跃动都在溶解皮质醇铠甲，每段低频振荡都在重组神经递质流。",
    "代谢能量｜心流指数":
        "当714Hz的泛音螺旋漫入耳蜗，线粒体群落开始共振发光。蝉蜕裂变的震颤波与甲壳素共振弦相耦合，形成动态解毒矩阵——每一声虫鸣都是打开溶酶体的声波密钥，每段谐频震荡都在催化三羧酸循环的量子跃迁。",
    "免疫能量｜专注度":
        "当639Hz的谐振密码渗入颞骨，NK细胞集群开始光速巡航。雨滴撞击凤梨科植物角质层的量子涟漪，与疗愈频率共振生成「液态干扰素」——每颗雨珠都是清洗淋巴管道的微型透析机，每段声频震荡都在强化上皮细胞的拓扑防御膜。",
    "消化能量｜安全感":
        "当528Hz的修复频率漫过十二指肠，钠钾泵组开始虹吸星尘能量。溪水撞击玄武岩的螺旋湍流，携带着负氢离子与脑波共振，生成「液态消化酶云」——每道漩流都是冲刷肠绒毛的微型水力涡轮，每段声频振荡都在催化益生菌群的量子通信。",
    "幸福能量｜NN50":
        "当417Hz的解锁频率漫过骶骨光轮，内啡肽洪流开始逆向攀爬脊柱。七金属震荡携氧波穿透腹部筋膜，与脑频共振生成「神经末梢觉醒素」——每道泛音都是解封快感阈值的振动探针，每段多频谐波都在重写血清素转运体的拓扑地图。",
    "动力能量｜LFHF":
        "当396Hz的解放频率穿透跟腱筋膜，肌梭传感器开始虹吸地核动能。钙化水珠撞击玄武岩的万亿次震颤波，携带电离氧原子穿透关节滑膜，生成「液态动力素」——每滴水都是叩击运动终板的量子液压泵，每段频率震荡都在重写Ⅱ型肌纤维的ATP供能公式。"
  };
  get txt => _txt;
  static const List<List> _pla = [
    ["15分钟", 900],
    ["30分钟", 1800],
    ["45分钟", 2700],
    ["60分钟", 3600]
  ];
  get pla => _pla;
}
