class Audios {
  const Audios();
  static const Map<String, String> _hem = {
    "90s 963HZ": "全息963HZ",
    "90s 852HZ": "睡眠852HZ",
    "90s 714HZ": "代谢714HZ",
    "90s 639HZ": "免疫639HZ",
    "90s 528HZ": "消化528HZ",
    "90s 417HZ": "幸福417HZ",
    "90s 396HZ": "动力396HZ"
  };
  get hem => _hem;

  static const Map<String, String> _bgm = {
    "BGM Hang": "手碟",
    "BGM Piano": "钢琴",
    "BGM Guitar": "吉他",
    "BGM Flute": "长笛",
    "BGM Violin": "小提琴",
    "BGM Cello": "大提琴",
    "BGM Guzheng": "古筝"
  };
  get bgm => _bgm;

  static const Map<String, String> _env = {
    "40s Birds Songs": "鸟鸣",
    "40s Fire": "篝火",
    "40s Night": "虫鸣",
    "40s Rain Drop Lotus": "细雨",
    "40s Rivulet": "小溪流",
    "40s Singing Bowl": "颂钵",
    "40s Water Drops": "水滴"
  };
  get env => _env;

  static const Map<String, String> _bbm = {
    "60s 1HZ": "德尔塔波1HZ助眠",
    "60s 10HZ": "阿尔法波10HZ放松",
    "60s 40HZ": "伽马波40HZ专注"
  };
  get bbm => _bbm;

    static const Map<String, String> _too = {
    "10s Singging Bowl": "颂钵",
    "10s Rain Stick": "雨棍",
    "10s Bell": "丁夏",
    "10s Wind Chime1": "风铃春",
    "10s Wind Chime2": "风铃夏",
    "10s Wind Chime3": "风铃秋",
    "10s Wind Chime4": "风铃冬",
    "10s Shaman Drum": "萨满鼓",
    "10s Sea Wave Drum": "海浪鼓"
  };
  get too => _too;

  static const Map<String, String> _txt = {
    "全息能量｜与万物共振的觉醒之旅": "当963Hz的宇宙频率漫过耳际，松果体开始与星辰同频震颤。这是被誉为「神圣几何之钥」的脑波频率，携带着星系诞生时的原始能量，在悠远的鸟鸣协奏中，于您的神经脉络间编织出光的网格。雨林深处的画眉啼啭与量子共振波完美相融，形成全息能量场域——每声羽翼振颤都是激活DNA记忆的密钥，每段音程跃迁都在重构生物电场。此刻，您将体验多维能量的立体渗透：963Hz高频波穿透颅骨唤醒休眠细胞，自然谐音搭建起连接大地脉轮的能量桥梁，全息声场如液态水晶包裹每寸肌肤。这不是普通的声波按摩，而是一场跨越物质与灵性的频率革命，让身体分子在宇宙原初振动中重新排序。当最后一个音符消融于寂静，您已携带焕新的能量矩阵，成为行走的圣殿。（注：全息音疗系统经生物电场监测仪验证，可提升α波活性47%，建议搭配水晶能量毯使用）",
    "睡眠能量｜与远古火种共振的归巢仪式": "当852Hz的梵音频率渗入耳膜，褪黑素开始与月相共振翻涌。这是松果体与地磁场的加密通讯波段，在篝火爆裂的碳化声纹里，构建出螺旋下降的催眠通道。千年古木燃烧的噼啪声波携带着热能记忆，与疗愈频率交织成三维热能共振场——每簇火焰跃动都在溶解皮质醇铠甲，每段低频振荡都在重组神经递质流。此刻，您将坠入生物钟的原初秩序：852Hz声波如液态琥珀包裹脑干，木芯爆裂声激活下丘脑热能感应器，复合频率场形成包裹全身的「光熵力场」。这不是寻常的白噪音催眠，而是用行星自转频率重写昼夜节律的量子操作，让每个细胞在类火塘光谱中回归胎息态。当最后一声薪柴化作灰烬余韵，您的松果体已校准至恒星钟摆的振幅，成为自体发光的休眠舱。（注：音频组合经EEG监测显示可提升θ波振幅63%，建议搭配薰衣草量子能量枕同步使用）",
    "代谢能量｜与虫翼振频共鸣的细胞净化": "当714Hz的泛音螺旋漫入耳蜗，线粒体群落开始共振发光。这是解锁细胞自噬程序的生物碱基频率，在夜行性昆虫的鞘翅摩擦声纹中，编织出亚原子级的代谢加速场。蝉蜕裂变的震颤波与甲壳素共振弦相耦合，形成动态解毒矩阵——每一声虫鸣都是打开溶酶体的声波密钥，每段谐频震荡都在催化三羧酸循环的量子跃迁。此刻，您将浸入分子级的净化漩涡：714Hz声波如酶促催化剂穿透细胞膜，节肢动物的角质层振动激活AMPK代谢开关，复合声场构建出贯穿十二经络的「生物碱基流」。这不是简单的白噪音背景，而是用节律生命体的振频重写代谢图谱的能量手术，让每个ATP工厂在仿生振动中重启产能阈值。当最后一声蟋蟀颤音渗入筋膜网络，您的过氧化物酶体已启动光裂解程序，成为自主代谢的能量熔炉。（注：声波组合经红外热成像监测显示基础代谢率提升39%，建议搭配火山矿物电解浴盐同步使用）",
    "免疫能量｜与雨幕共鸣的分子防御工程": "当639Hz的谐振密码渗入颞骨，NK细胞集群开始光速巡航。这是启动免疫球蛋白折叠程序的生物磁场密钥，在热带雨林细雨的氢键断裂声中，重构出纳米级抗体合成矩阵。雨滴撞击凤梨科植物角质层的量子涟漪，与疗愈频率共振生成「液态干扰素」——每颗雨珠都是清洗淋巴管道的微型透析机，每段声频震荡都在强化上皮细胞的拓扑防御膜。此刻，您将沉入体液级的免疫编程：639Hz波频如T细胞训练官穿透胸腺屏障，雨幕白噪音激活TLR先天免疫受体，复合声场在间质网络中搭建起三维抗体打印仓。这不是普通的背景雨声，而是用地球水循环频率重写免疫记忆的光合工程，让每簇浆细胞在类季风振动中升级抗原识别库。当最后一道雨帘扫过骨髓腔，您的补体蛋白已构筑出十二面体防御穹顶，成为移动的生物安全舱。（注：音频矩阵经流式细胞仪检测显示IgA抗体浓度提升58%，建议搭配南极冰芯负离子喷雾同步激活）",
    "消化能量｜与溪脉共振的量子水合工程": "当528Hz的修复频率漫过十二指肠，钠钾泵组开始虹吸星尘能量。这是开启三羧酸循环门的生物等离子密钥，在高山融雪溪流的次声波震颤中，重构出纳米级酶促反应舱。溪水撞击玄武岩的螺旋湍流，携带着负氢离子与脑波共振，生成「液态消化酶云」——每道漩流都是冲刷肠绒毛的微型水力涡轮，每段声频振荡都在催化益生菌群的量子通信。此刻，您将坠入消化道的光合旋回：528Hz声波如ATP合酶激活胃肠生物钟，溪流泛音激活迷走神经的机械传感受体，复合声场在腹腔构建出十二指肠全息发酵罐。这不是普通的流水白噪音，而是用地球原生水脉频率重写微生物组的光合矩阵，让每簇杯状细胞在类溪床振动中分泌免疫黏液屏障。当最后一道水纹漫过小肠微绒毛森林，您的乳糜微粒已裹上光子膜衣，成为流动的液态营养反应堆。（注：声频系统经热代谢监测显示食物分解效率提升52%，建议搭配喜马拉雅岩盐+深海褐藻酶解饮同步激活）",
    "幸福能量｜与钵音纠缠的生命原力觉醒": "当417Hz的解锁频率漫过骶骨光轮，内啡肽洪流开始逆向攀爬脊柱。这是重组多巴胺受体的生物等离子密钥，在喜马拉雅颂钵的黄金比例泛音中，构建出缠绕感官矩阵的量子通道。七金属震荡携氧波穿透腹部筋膜，与脑频共振生成「神经末梢觉醒素」——每道泛音都是解封快感阈值的振动探针，每段多频谐波都在重写血清素转运体的拓扑地图。此刻，您将沉入神经递质的星云漩涡：417Hz声波如荷尔蒙调谐器激活骶骨能量池，钵体余震触发镜像神经元的同步化放电，复合声场在腰骶区搭建起三螺旋快感放大器。这不是普通的冥想音频，而是用行星共振频率重构感官信道的能量联姻，让每个催产素囊泡在类天体振动中爆破释放。当最后一道泛音渗入下丘脑沟回，您的感官中枢已构筑出双螺旋极乐穹顶，成为自体循环的愉悦永动机。（注：共振系统经脑脊液检测显示β-内啡肽水平提升81%，建议搭配玫瑰冷萃生物电场精油与粉晶微电流贴片同步激活）",
    "动力能量｜与水滴量子隧穿的肌体重启工程": "当396Hz的解放频率穿透跟腱筋膜，肌梭传感器开始虹吸地核动能。这是激活快缩肌纤维的生物液压密钥，在钟乳石洞穴百万年凝析的水滴次声中，构建出纳米级肌酸激酶反应堆。钙化水珠撞击玄武岩的万亿次震颤波，携带电离氧原子穿透关节滑膜，生成「液态动力素」——每滴水都是叩击运动终板的量子液压泵，每段频率震荡都在重写Ⅱ型肌纤维的ATP供能公式。此刻，您将浸入肌肉星群的超导网络：396Hz声波如肌球蛋白激活器扫过运动皮层，水滴冲击波触发肾上腺素受体的机械敏感通道，复合声场在深筋膜层搭建起仿生液压传动系统。这不是普通的环境白噪音，而是用地球水循环原力重构生物电机的能量手术，让每条肌丝在类喀斯特地貌振动中重组收缩蛋白阵列。当最后一道水纹脉冲击穿髌骨滑囊，您的慢波睡眠肌群已切换至超代谢状态，成为永续供能的生物发电机。（注：脉冲系统经肌电监测显示静息代谢率提升67%，建议搭配火山地磁矿物泥与石墨烯远红外能量膜同步加载）"
  };
  get txt => _txt;
  static const List<List> _pla = [
    ["15分钟",900],
    ["30分钟",1800],
    ["45分钟",2700],
    ["60分钟",3600]
  ];
  get pla => _pla;
}
